#+TITLE:     Intro til Rust
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  no
#+DATE:
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:https://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [bigger]
#+LaTeX_HEADER: \setminted{fontsize=\footnotesize}
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

*** Printing
#+BEGIN_SRC rust
println!("Print til skjerm");

let x = 2;
let y = 7;
let result = x + y;
println!("{} + {} = {}", x, y, result);

println!("{x} + {y} = {result}");
#+END_SRC

#+RESULTS:
: Print til skjerm
: 2 + 7 = 9
: 2 + 7 = 9

*** Match statement
#+BEGIN_SRC rust
let action: Action = player.get_user_action();

match action {
    Move(x, y) => {
        board[x, y] = player;
        advance_turn();
    }
    Wait => advance_turn(),
}
#+END_SRC

#+RESULTS:
: error: Could not compile `cargoHYiCf9`.

*** Result
#+BEGIN_SRC rust
let x: Result<String, i32> = fetch_url("google.com");

match x {
    Ok(response) => println!("{response}"),
    Err(error_code) => {
        println!("Failed with error {error_code}")
    }
}
#+END_SRC

#+RESULTS:
: error: Could not compile `cargosvkjSd`.

*** Ownership
#+BEGIN_SRC rust :include '(player_struct player_impl)
let player = Player::new();
let player2 = player;

println!("{}", player.health);
#+END_SRC

#+RESULTS:
: 5

*** Ownership
#+BEGIN_SRC rust :include '(player_struct player_impl)
fn mystery(player: Player) {
    ...
}

let player = Player::new();
mystery(player);

println!("{}", player.health);
#+END_SRC

#+RESULTS:
: 5

*** Ownership
#+NAME: player_copyable
#+BEGIN_SRC rust
#[derive(Clone)]
struct Player {
    pub health: u8,
    pub position: (u8, u8),
    inventory: Vec<String>,
}
#+END_SRC

#+RESULTS: player_copyable

#+BEGIN_SRC rust :include '(player_copyable player_impl)
let player = Player::new();
let player2 = player.clone();

println!("{}", player.health);
#+END_SRC

#+RESULTS:
: 100

*** Borrowing
#+BEGIN_SRC rust
let mut x = 5;
let xref = &x;
let xmutref = &mut x;

println!("{xref}");
#+END_SRC

#+RESULTS:
: error: Could not compile `cargoJKDS1V`.

*** Borrowing
#+BEGIN_SRC rust
let mut x = 5;

if x == 7 {
    let xmutref = &mut x;
}

let xref = &x;
#+END_SRC

#+RESULTS:
: error: Could not compile `cargoJKDS1V`.

*** Lifetimes
#+BEGIN_SRC rust :include '(lifetime_max)
let mut largest: &i32 = &0;

if something {
    let x = fetch();
    let y = fetch();
    largest = max(&x, &y);
}

do_something(largest);
#+END_SRC

#+RESULTS:
: error: Could not compile `cargonze0bF`.

*** Iterators
#+BEGIN_SRC rust
let list = vec![1, 2, 3];

for x in &list {
    println!("{}", x);
}

list.iter().for_each(|x| {
    println!("{}", x);
});

list.into_iter().for_each(|x| {
    println!("{}", x);
});
#+END_SRC

#+RESULTS:
: 1
: 2
: 3
: 1
: 2
: 3
: 1
: 2
: 3

